%将数据离散图和计算得出的拟合曲线画出比较
t=[4.36,10,16.664,20,26.664,30,35,40,45,50,55,60,65,70];
tt=[3.78,6.99,11.32,15.32,19.67,24,24.33,24,25,23,23.47,24,22.9,23.9];
plot(t,tt,'o');
hold on
x=0:1.5:70;
y=24./(1+exp(-0.1689*(x-16.2083)));
plot(x,y,'k->');
xlabel('RF-in Power','FontSize',12);
ylabel('EH energy','FontSize',12);
set(gca,'GridLineStyle',':','GridColor','k', 'GridAlpha',0.8);
grid on;
hold on
% t=[3.2,3.6,3.8,4,4.2,4.8,5,5.4,6.2,6.4,6.6,6.9,7.1]';
% tt=[0.38,0.66,1,0.77,0.5,0.66,0.83,1,0.71,0.71,1,0.87,0.83]';
% plot(t,tt,'.');
% hold on%保证同时显示
% x = 0:0.01:8;
% y = 1./(1.1562+15.1875.*exp(-x));
% plot(x,y);


